In [ ]:
import pandas as pd

In [2]:
df = pd.read_csv("./data/students-data.csv");

In [3]:
df

            Name  RegNo    m1    m2    m3 Result
0    Alice Smith  101.0  85.0  90.0  88.0   Pass
1    Bob Johnson  102.0  70.0   NaN  80.0   Pass
2  Charlie Brown  103.0  45.0  50.0   NaN   Fail
3      Daisy Lee  104.0   NaN  88.0  95.0   Pass
4    Ethan Davis  105.0  60.0  58.0  65.0   Pass
5   Fiona Garcia  106.0  40.0   NaN  38.0   Fail
6  George Harris  107.0  75.0  80.0  85.0   Pass
7  Hannah Wilson    NaN  50.0  48.0  52.0   Fail
8   Ian Martinez  109.0  88.0  92.0   NaN   Pass
9     Jane Clark  110.0  68.0  70.0   NaN   Pass

In [4]:
df.head(2)

          Name  RegNo    m1    m2    m3 Result
0  Alice Smith  101.0  85.0  90.0  88.0   Pass
1  Bob Johnson  102.0  70.0   NaN  80.0   Pass

In [5]:
df.tail(2)

           Name  RegNo    m1    m2  m3 Result
8  Ian Martinez  109.0  88.0  92.0 NaN   Pass
9    Jane Clark  110.0  68.0  70.0 NaN   Pass